[
  {
    "id": "1",
    "title": "Grand Theft Auto III",
    "author": "Abdelrahman",
    "date": "27-11-2025",
    "content": "Grand Theft Auto III is a 2001 action-adventure game developed by DMA Design and published by Rockstar Games. It was the first 3D game in the Grand Theft Auto series. Set in Liberty City, loosely based on New York City, the story follows Claude, a silent protagonist who becomes entangled in a world of crime, drugs, gang warfare and corruption. The game is played from a third-person perspective and its world is navigated on foot or by vehicle. Its open world design lets players freely roam Liberty City.\n\nDevelopment was shared between DMA Design, based in Edinburgh, and Rockstar, based in New York City. Development involved transforming popular Grand Theft Auto elements into a fully 3D world for the first time. The game was delayed following the September 11 attacks to allow the team to change references and gameplay deemed inappropriate. Grand Theft Auto III was released in October 2001 for the PlayStation 2, in May 2002 for Windows, and in November 2003 for the Xbox. Mobile ports were released for the tenth anniversary in 2011, followed by a remastered version for the twentieth in 2021.\n\nGrand Theft Auto III received acclaim for its concept, gameplay, sound design, and visual fidelity, but generated controversies for its violent and sexual content. It received year-end accolades from several gaming publications, and it is considered a landmark game in the open world concept, one of the most significant games of the sixth generation of consoles, and among the best video games ever made. It was the best-selling video game of 2001 and among the best-selling PlayStation 2 games with over 11.6 million copies sold; it has sold over 14.5 million copies overall. The game was followed by Grand Theft Auto: Vice City (2002) and two prequels, Advance (2004) and Liberty City Stories (2005).",
    "image": "https://www.rockstargames.com/img/global/downloads/wallpapers/games/gta3-lithograph_claude_2560x1600.jpg"
  },
  {
    "id": "2",
    "title": "Grand Theft Auto Vice City",
    "author": "Abdelrahman",
    "date": "27-11-2025",
    "content": "Grand Theft Auto: Vice City is a 2002 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the fourth main game in the Grand Theft Auto series, following 2001's Grand Theft Auto III, and the sixth entry overall. Set in 1986 within the fictional Vice City (based on Miami), the single-player story follows gangster Tommy Vercetti's rise to power after being released from prison and becoming caught up in an ambushed drug deal. While seeking out those responsible, Tommy gradually builds a criminal empire by seizing power from other criminal organisations.\n\nThe game is played from a third-person perspective and its world is navigated on foot or by vehicle. The open world design lets the player freely roam Vice City, consisting of two main islands. The game's plot is based on multiple real-world people and events in Miami such as Cubans, Haitians, and biker gangs, the 1980s crack epidemic, the Mafioso drug lords of Miami, and the dominance of glam metal. The game was also influenced by the films and television of the era, most notably Scarface (1983) and Miami Vice (1984–1990). Much of the development work constituted creating the game world to fit the inspiration and time period; the development team conducted extensive field research in Miami while creating the world. The game was released in October 2002 for the PlayStation 2.\n\nVice City received critical acclaim, with praise directed at its music, gameplay, story, and open world design, though it generated controversy over its depiction of violence and racial groups. It received year-end accolades from several gaming publications, and it is considered one of the sixth generation of console gaming's most significant titles and among the best video games ever made. Vice City became the best-selling game of 2002 and one of the best-selling PlayStation 2 games with over 14.2 million copies sold; it has sold over 17.5 million copies overall. It was released for Windows and the Xbox in 2003, followed by enhanced versions and mobile ports in the 2010s and a remastered version in 2021. It was followed by Grand Theft Auto: San Andreas (2004) and a prequel, Vice City Stories (2006).",
    "image": "https://www.rockstargames.com/img/global/downloads/wallpapers/games/gtavc_wildstyle_2880x1800.jpg",
    "youtubeId": "m8oQllwqw_I"
  },
  {
    "id": "3",
    "title": "Grand Theft Auto San Andreas",
    "author": "Abdelrahman",
    "date": "27-11-2025",
    "content": "Grand Theft Auto: San Andreas is a 2004 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the seventh overall entry in the Grand Theft Auto series and the fifth main game, following 2002's Grand Theft Auto: Vice City. Set within the fictional U.S. state of San Andreas (based on California and Nevada) in 1992, the game follows Carl \"CJ\" Johnson, who returns home after his mother's murder. Finding his street gang in decline, CJ works to rebuild it while clashing with corrupt authorities and rival criminals, and gradually uncovers the truth behind his mother's death.\n\nThe game is played from a third-person perspective and its world is navigated on foot or by vehicle. The open world design lets the player freely roam San Andreas, consisting of three major metropolitan cities: Los Santos, San Fierro, and Las Venturas, based on Los Angeles, San Francisco, and Las Vegas, respectively. Rockstar conducted on-site research in each city and consulted Los Angeles natives DJ Pooh, Estevan Oriol, and Mister Cartoon for help imitating the city's culture. The narrative is based on multiple real-life events in Los Angeles, including the Bloods and Crips street gang rivalry, the 1990s crack epidemic, the 1992 Los Angeles riots, and the Rampart scandal. The 75-person development team spent nearly two years creating the game. San Andreas was released in October 2004 for the PlayStation 2.\n\nThe game received critical acclaim for its characters, narrative, open world design, and visual fidelity, but mixed responses towards its mission design, technical issues, and portrayal of race. It generated controversy when the hidden \"Hot Coffee\" sex minigame was discovered, briefly requiring the game to be re-rated Adults Only. San Andreas received year-end accolades from several gaming publications, and it is considered one of the sixth generation of console gaming's most significant titles and among the best video games ever made. It was released for Windows and the Xbox in 2005, followed by enhanced versions and mobile ports in the 2010s, and a remastered version in 2021. San Andreas is the best-selling PlayStation 2 game with over 17.3 million copies sold, and one of the best-selling games of all time with 27.5 million copies sold overall. Its successor, Grand Theft Auto IV, was released in April 2008.",
    "image": "https://www.rockstargames.com/img/global/downloads/wallpapers/games/sanandreas_grovestreetfamily_2880x1800.jpg"
  }
]
